{
  "backend/main.mo": "Defines authorization-backed manufacturing request workflow, user profiles, and approval logic with request creation and approval operations.",
  "feature_evidence.json": "Lists feature evidence mappings connecting features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of frontend files including hooks, pages, and UI components.",
  "frontend/index.css": "Sets global Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routing, authentication gating, profile setup, and layout wrapper.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays a login prompt for unauthenticated users with an Internet Identity sign‑in button.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders login/logout button handling Internet Identity authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog collecting a user's name and saving their profile on first login.",
  "frontend/src/components/common/StatePanels.tsx": "Reusable loading, empty, and error UI panels for consistent state display across pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main application layout with navigation, header, footer, and routing outlet, dynamically showing approval links based on user data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useApprovals.ts": "Fetches approvals for the current user and provides approve/reject mutations with query invalidation logic.",
  "frontend/src/hooks/useAuthz.ts": "Exposes authentication state and a logout function that clears identity and cached queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Retrieves and updates the caller’s user profile using the backend actor with query invalidation on save.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useRequests.ts": "Provides hooks to fetch user requests, fetch a single request, submit new requests, and map request statuses to display variants.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider setup.",
  "frontend/src/pages/CreateRequestPage.tsx": "Form page for submitting a new manufacturing request, handling validation, submission, and navigation.",
  "frontend/src/pages/MyApprovalsPage.tsx": "Displays the current user's pending approvals, handling loading/error states and listing actionable requests in a table.",
  "frontend/src/pages/MyRequestsPage.tsx": "Shows all requests created by the user with their statuses, approval progress, and navigation to detailed views.",
  "frontend/src/pages/RequestDetailPage.tsx": "Loads a specific request, displays its details and status, and allows approvers to approve or reject with comments if authorized.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins for the app's UI styling.",
  "project_state.json": "Project metadata describing the approval workflow app, existing implemented features, pending feature requests, and architectural notes."
}